#include "game/light.h"

#include "game/critter.h"
#include "game/gamelib.h"
#include "game/object.h"
#include "game/sector.h"
#include "game/sector_block_list.h"
#include "game/tile.h"

typedef struct LightCreateInfo {
    /* 0000 */ int64_t obj;
    /* 0008 */ int64_t loc;
    /* 0010 */ int offset_x;
    /* 0014 */ int offset_y;
    /* 0018 */ tig_art_id_t art_id;
    /* 001C */ unsigned int flags;
    /* 0020 */ uint8_t r;
    /* 0021 */ uint8_t g;
    /* 0022 */ uint8_t b;
} LightCreateInfo;

typedef void(LightCreateFunc)(LightCreateInfo* create_info, Light** light_ptr);

// NOTE: This structure represents light data as it is stored on disk. Its
// memory layout is set in stone and should never change. The main difference
// from `Light` is the type of the `palette` member. Originally, it is a
// pointer, which breaks the memory layout on x64 platforms. This value is
// always `0`, regardless of the pointer value. The engine always nullifies it
// when it's read back.
typedef struct LightSerializedData {
    /* 0000 */ int64_t obj;
    /* 0008 */ int64_t loc;
    /* 0010 */ int offset_x;
    /* 0014 */ int offset_y;
    /* 0018 */ unsigned int flags;
    /* 001C */ tig_art_id_t art_id;
    /* 0020 */ uint8_t r;
    /* 0021 */ uint8_t b;
    /* 0022 */ uint8_t g;
    /* 0024 */ tig_color_t tint_color;
    /* 0028 */ int palette;
    /* 002C */ int padding_2C;
} LightSerializedData;

// Serializeable.
static_assert(sizeof(LightSerializedData) == 0x30, "wrong size");

static bool sub_4D89E0(int64_t loc, int a2, int a3, int a4, tig_color_t* color_ptr);
static void sub_4D9310(LightCreateInfo* create_info, Light** light_ptr);
static void sub_4D93B0(Light* light);
static void sub_4D9510(Light* light);
static void sub_4DD320(Light* light, int64_t loc, int offset_x, int offset_y);
static void sub_4DD500(Light* light, int offset_x, int offset_y);
static void light_set_aid(Light* light, tig_art_id_t art_id);
static tig_art_id_t light_get_aid(Light* light);
static void light_set_custom_color(Light* light, uint8_t r, uint8_t g, uint8_t b);
static bool sub_4DDD90(Sector* sector);
static void shadows_changed(void);
static bool light_buffers_init(void);
static void light_buffers_exit(void);
static bool sub_4DE0B0(tig_art_id_t art_id, TigPaletteModifyInfo* modify_info);
static void light_ambient_palettes_init(void);
