#include "ui/inven_ui.h"

#include <stdio.h>

#include "game/ai.h"
#include "game/critter.h"
#include "game/dialog.h"
#include "game/gsound.h"
#include "game/hrp.h"
#include "game/item.h"
#include "game/mes.h"
#include "game/mp_utils.h"
#include "game/multiplayer.h"
#include "game/obj.h"
#include "game/obj_private.h"
#include "game/object.h"
#include "game/player.h"
#include "game/portrait.h"
#include "game/proto.h"
#include "game/reaction.h"
#include "game/script.h"
#include "game/sfx.h"
#include "game/skill.h"
#include "game/snd.h"
#include "game/spell.h"
#include "game/stat.h"
#include "game/target.h"
#include "ui/gameuilib.h"
#include "ui/hotkey_ui.h"
#include "ui/intgame.h"
#include "ui/item_ui.h"
#include "ui/mainmenu_ui.h"
#include "ui/scrollbar_ui.h"
#include "ui/skill_ui.h"
#include "ui/spell_ui.h"
#include "ui/tb_ui.h"

typedef enum InvenUiPanel {
    INVEN_UI_PANEL_INVENTORY,
    INVEN_UI_PANEL_PAPERDOLL,
} InvenUiPanel;

typedef enum InvenUiSummary {
    INVEN_UI_SUMMARY_WEIGHT,
    INVEN_UI_SUMMARY_ENCUMBRANCE,
    INVEN_UI_SUMMARY_INFO_SPEED,
} InvenUiSummary;

typedef enum InvenUiTotalStat {
    INVEN_UI_TOTAL_ATTACK,
    INVEN_UI_TOTAL_DEFENSE,
} InvenUiTotalStat;

typedef struct S5754C0 {
    /* 0000 */ int x;
    /* 0004 */ int y;
    /* 0008 */ int64_t field_8;
    /* 0010 */ int64_t field_10;
    /* 0018 */ int64_t field_18;
    /* 0020 */ int mode;
    /* 0024 */ int field_24;
    /* 0028 */ int field_28;
    /* 002C */ int field_2C;
} S5754C0;

// Serializeable.
static_assert(sizeof(S5754C0) == 0x30, "wrong size");

static bool sub_572340(void);
static bool inven_ui_message_filter(TigMessage* msg);
static void sub_574FD0(bool next);
static bool sub_575100(bool* a1);
static bool sub_575180(bool* a1);
static void sub_575200(int a1);
static void sub_575360(int a1);
static void sub_5754C0(int x, int y);
static bool sub_575580(void* userinfo);
static bool sub_5755A0(void* userinfo);
static void sub_575BE0(void);
static int sub_575CB0(int x, int y, int64_t* a3);
static int64_t sub_575FA0(int x, int y, int64_t* a3);
static void redraw_inven_fix_bad_inven_obj(int64_t a1);
static bool redraw_inven_fix_bad_inven(int64_t a1, int64_t a2);
static void redraw_inven(bool a1);
static tig_art_id_t sub_5782D0(void);
static const char* const* inven_ui_bg_candidates(void);
static bool inven_ui_blit_custom_bg(const TigRect* canvas_rect, const TigRect* dst_rect);
