#include "ui/wmap_ui.h"

#include <stdio.h>

#include "game/ai.h"
#include "game/anim.h"
#include "game/antiteleport.h"
#include "game/area.h"
#include "game/critter.h"
#include "game/gamelib.h"
#include "game/gsound.h"
#include "game/hrp.h"
#include "game/location.h"
#include "game/magictech.h"
#include "game/map.h"
#include "game/mes.h"
#include "game/obj.h"
#include "game/path.h"
#include "game/player.h"
#include "game/sector.h"
#include "game/teleport.h"
#include "game/townmap.h"
#include "game/ui.h"
#include "ui/anim_ui.h"
#include "ui/gameuilib.h"
#include "ui/intgame.h"
#include "ui/textedit_ui.h"
#include "ui/types.h"

typedef enum WmapUiMode {
    WMAP_UI_MODE_WORLD,
    WMAP_UI_MODE_CONTINENT,
    WMAP_UI_MODE_TOWN,
    WMAP_UI_MODE_COUNT,
} WmapUiMode;

typedef enum WmapNoteType {
    WMAP_NOTE_TYPE_NOTE,
    WMAP_NOTE_TYPE_SKULL,
    WMAP_NOTE_TYPE_CHEST,
    WMAP_NOTE_TYPE_QUEST,
    WMAP_NOTE_TYPE_CROSS,
    WMAP_NOTE_TYPE_LOC,
    WMAP_NOTE_TYPE_WAYPOINT,
    WMAP_NOTE_TYPE_NEW_LOC,
    WMAP_NOTE_TYPE_COUNT,
} WmapNoteType;

typedef enum WmapRouteType {
    WMAP_ROUTE_TYPE_WORLD,
    WMAP_ROUTE_TYPE_TOWN,
    WMAP_ROUTE_TYPE_COUNT,
} WmapRouteType;

typedef enum WmapUiState {
    /**
     * The UI is stationary.
     */
    WMAP_UI_STATE_NORMAL,

    /**
     * NOTE: Not implemented in the original code. Looks like the idea was to
     * allow moving/updating individual waypoints on the path.
     */
    WMAP_UI_STATE_1,

    /**
     * Moving along the route.
     */
    WMAP_UI_STATE_MOVING,

    /**
     * NOTE: Not implemented in the original code. The idea was to allow
     * creating/editing custom map notes.
     */
    WMAP_UI_STATE_EDITING,

    /**
     * Navigating the map by pressing and holding directional pad in the center
     * of the map.
     */
    WMAP_UI_STATE_NAVIGATING,
} WmapUiState;

typedef struct WmapCoords {
    int x;
    int y;
} WmapCoords;

typedef struct WmapNoteTypeInfo {
    // NOTE: Rare case - during initialization the value at offset 0 is art num,
    // which is replaced with interface art id (see `wmap_ui_init`).
    union {
        int num;
        tig_art_id_t art_id;
    };
    /* 0004 */ int width;
    /* 0008 */ int height;
    /* 000C */ tig_color_t color;
    /* 0010 */ tig_font_handle_t font;
    /* 0014 */ bool enabled;
} WmapNoteTypeInfo;

typedef struct WmapNote {
    /* 0000 */ int id;
    /* 0004 */ unsigned int flags;
    /* 0008 */ WmapCoords coords;
    /* 0010 */ int64_t field_10;
    /* 0018 */ TigRect field_18;
    /* 0028 */ WmapNoteType type;
    /* 002C */ char str[250];
    /* 0128 */ TigVideoBuffer* video_buffer;
} WmapNote;

typedef struct WmapTile {
    /* 0000 */ unsigned int flags;
    /* 0004 */ TigVideoBuffer* video_buffer;
    /* 0008 */ TigRect rect;
    /* 0018 */ void* field_18;
    /* 001C */ int field_1C;
} WmapTile;

typedef struct WmapInfo {
    /* 0000 */ unsigned int flags;
    /* 0004 */ TigRect rect;
    /* 0014 */ TigRect field_14;
    /* 0024 */ int field_24;
    /* 0028 */ int field_28;
    /* 002C */ int field_2C;
    /* 0030 */ int field_30;
    /* 0034 */ int field_34;
    /* 0038 */ int field_38;
    /* 003C */ WmapCoords field_3C;
    /* 0044 */ bool navigatable;
    /* 0048 */ void (*refresh)(void);
    /* 004C */ void (*refresh_rect)(TigRect* rect);
    /* 0050 */ void (*field_50)(int direction, int, int, int);
    /* 0054 */ int field_54;
    /* 0058 */ int map_width;
    /* 005C */ int map_height;
    /* 0060 */ int field_60;
    /* 0064 */ int field_64;
    /* 0068 */ char field_68[TIG_MAX_PATH];
    /* 016C */ int tile_width;
    /* 0170 */ int tile_height;
    /* 0174 */ int num_tiles;
    /* 0178 */ int num_hor_tiles;
    /* 017C */ int num_vert_tiles;
    /* 0180 */ WmapTile* tiles;
    /* 0184 */ int num_loaded_tiles;
    /* 0188 */ WmapNote* notes;
    /* 018C */ int field_18C;
    /* 0190 */ int* num_notes;
    /* 0194 */ int field_194;
    /* 0198 */ int field_198;
    /* 019C */ int field_19C;
    /* 01A0 */ int field_1A0;
    /* 01A4 */ char str[260];
    /* 02A8 */ TigRect field_2A8;
    /* 02B8 */ TigVideoBuffer* video_buffer;
    /* 02BC */ void (*field_2BC)(int x, int y, WmapCoords* coords);
} WmapInfo;

typedef struct WmapRouteWaypoint {
    /* 0000 */ int field_0;
    /* 0004 */ int field_4;
    /* 0008 */ WmapCoords coords;
    /* 0010 */ int64_t loc;
    /* 0018 */ int start;
    /* 001C */ int steps;
} WmapRouteWaypoint;

typedef struct WmapRoute {
    /* 0000 */ WmapRouteWaypoint waypoints[30];
    /* 03C0 */ int length;
    /* 03C4 */ int field_3C4;
    /* 03C8 */ int field_3C8;
    /* 03CC */ int field_3CC;
} WmapRoute;

// 0x5C9160
static WmapNoteTypeInfo wmap_note_type_info[WMAP_NOTE_TYPE_COUNT] = {
    /*     WMAP_NOTE_TYPE_NOTE */ { .num = 142, .enabled = true },
    /*    WMAP_NOTE_TYPE_SKULL */ { .num = 144, .enabled = true },
    /*    WMAP_NOTE_TYPE_CHEST */ { .num = 141, .enabled = true },
    /*    WMAP_NOTE_TYPE_QUEST */ { .num = 143, .enabled = true },
    /*    WMAP_NOTE_TYPE_CROSS */ { .num = 204, .enabled = true },
    /*      WMAP_NOTE_TYPE_LOC */ { .num = 205, .enabled = true },
    /* WMAP_NOTE_TYPE_WAYPOINT */ { .num = 206, .enabled = true },
    /*  WMAP_NOTE_TYPE_NEW_LOC */ { .num = 814, .enabled = true },
};

static void sub_560010(void);
static void wmap_ui_town_notes_save(void);
static void wmap_ui_destroy(void);
static bool wmap_ui_town_note_save(WmapNote* note, TigFile* stream);
static bool wmap_ui_rect_write(TigRect* rect, TigFile* stream);
static bool wmap_ui_town_note_load(WmapNote* note, TigFile* stream);
